read_verilog cpu.v alu.v alucontrol.v control.v immgen.v registers.v
synth_xilinx -top cpu
write_verilog cpu_synth.v
